In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
from pandas import Series,DataFrame

# **`Reshaping`**

In [4]:
a=DataFrame(np.arange(8).reshape(2,4),index=pd.Index(['La','ny'],name='cities'),columns=pd.Index(['a','b','c','d'],name='columns'))

In [5]:
a

columns  a  b  c  d
cities
La       0  1  2  3
ny       4  5  6  7

In [6]:
a.loc(0)

In [7]:
a[0:1]

columns  a  b  c  d
cities
La       0  1  2  3

## **Stacking**

In [8]:
b=a.stack()

In [9]:
b

cities  columns
La      a          0
        b          1
        c          2
        d          3
ny      a          4
        b          5
        c          6
        d          7
dtype: int64

In [10]:
c=b.unstack()

In [11]:
c

columns  a  b  c  d
cities
La       0  1  2  3
ny       4  5  6  7

In [12]:
b.unstack(0)

cities   La  ny
columns
a         0   4
b         1   5
c         2   6
d         3   7

In [13]:
b.unstack(1)

columns  a  b  c  d
cities
La       0  1  2  3
ny       4  5  6  7

In [44]:
b.unstack('cities')

cities   La  ny
columns
a         0   4
b         1   5
c         2   6
d         3   7

In [46]:
y=DataFrame([[1,2,3,4],[np.nan,5,6,3],[7,np.nan,9,4],[np.nan,np.nan,np.nan,5],[np.nan,4,np.nan,5]])

In [48]:
y

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  NaN  9.0  4
3  NaN  NaN  NaN  5
4  NaN  4.0  NaN  5

In [49]:
y.dropna(thresh=2)

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  NaN  9.0  4
4  NaN  4.0  NaN  5

In [50]:
y.dropna(thresh=1)

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  NaN  9.0  4
3  NaN  NaN  NaN  5
4  NaN  4.0  NaN  5

In [51]:
y.dropna(thresh=3)

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  NaN  9.0  4

In [52]:
y.fillna(1)

     0    1    2  3
0  1.0  2.0  3.0  4
1  1.0  5.0  6.0  3
2  7.0  1.0  9.0  4
3  1.0  1.0  1.0  5
4  1.0  4.0  1.0  5

In [53]:
y

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  NaN  9.0  4
3  NaN  NaN  NaN  5
4  NaN  4.0  NaN  5

In [54]:
y.fillna({2:0,0:1,1:2})

     0    1    2  3
0  1.0  2.0  3.0  4
1  1.0  5.0  6.0  3
2  7.0  2.0  9.0  4
3  1.0  2.0  0.0  5
4  1.0  4.0  0.0  5

In [55]:
y.fillna({1:2})

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  2.0  9.0  4
3  NaN  2.0  NaN  5
4  NaN  4.0  NaN  5

In [56]:
y.fillna({0:3})

     0    1    2  3
0  1.0  2.0  3.0  4
1  3.0  5.0  6.0  3
2  7.0  NaN  9.0  4
3  3.0  NaN  NaN  5
4  3.0  4.0  NaN  5

In [57]:
y

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  NaN  9.0  4
3  NaN  NaN  NaN  5
4  NaN  4.0  NaN  5

In [59]:
y.fillna({1:0,1:2},inplace=True)   #....................changes the original

In [60]:
y

     0    1    2  3
0  1.0  2.0  3.0  4
1  NaN  5.0  6.0  3
2  7.0  2.0  9.0  4
3  NaN  2.0  NaN  5
4  NaN  4.0  NaN  5

## **Merge**

Type 1 - Merging in the base on columns

In [15]:
A = {
    0 : 'x',
    1 : 'z',
    2 : 'y',
    3 : 'z',
    4 : 'x',
    5 : 'x'

}

In [16]:
A

{0: 'x', 1: 'z', 2: 'y', 3: 'z', 4: 'x', 5: 'x'}

In [17]:
B = DataFrame({'ds1':[0,1,2,3,4,5],'Key':['x','z','y','z','x','x']})                  #ds1

In [18]:
B

   ds1 Key
0    0   x
1    1   z
2    2   y
3    3   z
4    4   x
5    5   x

In [19]:
C = DataFrame({'ds2':[1,2,3],'Key':['q','y','z']})                                          #ds2

In [20]:
C

   ds2 Key
0    1   q
1    2   y
2    3   z

In [21]:
import pandas as pd
  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
df = pd.DataFrame(dict)
  
df

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

In [22]:
pd.merge(B,C)

   ds1 Key  ds2
0    1   z    3
1    3   z    3
2    2   y    2

In [23]:
D = DataFrame({'Prod_flip':['Apple','One+','Xaiomi'],'Sales':[5000,1200,700]})                                          #ds2

In [24]:
E = DataFrame({'Prod_amaz':['Apple','One+','Xaiomi'],'Sales':[8000,3000,1130]})                                          #ds2

In [25]:
D

  Prod_flip  Sales
0     Apple   5000
1      One+   1200
2    Xaiomi    700

In [43]:
E

  Prod_amaz  Sales
0     Apple   8000
1      One+   3000
2    Xaiomi   1130

In [27]:
pd.merge(D,E)

Empty DataFrame
Columns: [Prod_flip, Sales, Prod_amaz]
Index: []

In [28]:
d = DataFrame({'Product':['Apple','One+','Xaiomi'],'Sales_flip':[5000,1200,700]})                                          #ds2

In [29]:
e = DataFrame({'Product':['Apple','One+','Xaiomi'],'Sales_amaz':[8000,3000,1130]})                                          #ds2

In [30]:
pd.merge(d,e)

  Product  Sales_flip  Sales_amaz
0   Apple        5000        8000
1    One+        1200        3000
2  Xaiomi         700        1130

In [92]:
pd.merge(B,C,on='Key')

   ds1 Key  ds2
0    1   z    3
1    3   z    3
2    2   y    2

# Tyoes of Join

*Types of join*
1. Inner Join - Intersection (df1+df2)
2. Left Join - Intersection (df1+df2) + df1
3. Right Join - Intersection (df1+df2) +df2
4. Outer Join - Intersection (df1+df2) + Outer remaining region

In [32]:
pd.merge(B,C,on='Key',how = 'left')

   ds1 Key  ds2
0    0   x  NaN
1    1   z  3.0
2    2   y  2.0
3    3   z  3.0
4    4   x  NaN
5    5   x  NaN

In [33]:
pd.merge(B,C,on='Key',how = 'right')

   ds1 Key  ds2
0  NaN   q    1
1  2.0   y    2
2  1.0   z    3
3  3.0   z    3

In [34]:
pd.merge(B,C,on='Key',how = 'outer')

   ds1 Key  ds2
0  0.0   x  NaN
1  4.0   x  NaN
2  5.0   x  NaN
3  1.0   z  3.0
4  3.0   z  3.0
5  2.0   y  2.0
6  NaN   q  1.0

In [35]:
F = DataFrame({'key1':['sf','sf','la'],'key2':['one','two','one'],'leftdata':[10,20,30]})                                          #ds2

In [36]:
G = DataFrame({'key1':['sf','sf','la','la'],'key2':['one','one','one','two'],'leftdata':[40,50,60,70]})                                          #ds2

In [37]:
F

  key1 key2  leftdata
0   sf  one        10
1   sf  two        20
2   la  one        30

In [38]:
G

  key1 key2  leftdata
0   sf  one        40
1   sf  one        50
2   la  one        60
3   la  two        70

In [39]:
H=pd.merge(F,G,on=['key1','key2'], how='outer')

In [40]:
H

  key1 key2  leftdata_x  leftdata_y
0   sf  one        10.0        40.0
1   sf  one        10.0        50.0
2   sf  two        20.0         NaN
3   la  one        30.0        60.0
4   la  two         NaN        70.0

# Merging on the basis of column and index

In [63]:
I=DataFrame({'Data':[0,1,2,3,4],"Key":['x','y','z','x','y']})

In [64]:
I

   Data Key
0     0   x
1     1   y
2     2   z
3     3   x
4     4   y

In [87]:
J=DataFrame({'GroupData':[10,20]},index=['x','y'])

In [88]:
J

   GroupData
x         10
y         20

In [71]:
pd.merge(I,J,left_on='Key',right_index=True)     #.....Key = column specification....right_index = index specification

   Data Key  GroupData
0     0   x         10
3     3   x         10
1     1   y         20
4     4   y         20

In [72]:
# left is I...........right is J

In [73]:
pd.merge(I,J,left_on='Key',right_on=index)     #.....Key = column specification....right_index = index specification

NameError: name 'index' is not defined

In [75]:
pd.merge(I,J,left_on='Key',right_index=True,how='outer')            #........we are getting 'z' here wiht outer join

   Data Key  GroupData
0     0   x       10.0
3     3   x       10.0
1     1   y       20.0
4     4   y       20.0
2     2   z        NaN

In [76]:
pd.merge(I,J,left_on='Key',right_index=True,how='left')            #........we are getting 'z' here wiht outer join

   Data Key  GroupData
0     0   x       10.0
1     1   y       20.0
2     2   z        NaN
3     3   x       10.0
4     4   y       20.0

In [77]:
pd.merge(I,J,left_on='Key',right_index=True,how='right')            #........we are getting 'z' here wiht outer join

   Data Key  GroupData
0     0   x         10
3     3   x         10
1     1   y         20
4     4   y         20

In [79]:
pd.merge(I,J,left_on='Key',right_index=True,how='inner')            #........we are getting 'z' here wiht outer join

   Data Key  GroupData
0     0   x         10
3     3   x         10
1     1   y         20
4     4   y         20

In [85]:
K=DataFrame({'GroupData':[10,20],'Value':['x','y']})

In [86]:
K

   GroupData Value
0         10     x
1         20     y

In [91]:
pd.merge(I,K, left_on='Key',right_on='Value')

   Data Key  GroupData Value
0     0   x         10     x
1     3   x         10     x
2     1   y         20     y
3     4   y         20     y